# Pandas 라이브러리

데이터 처리, 분석에 사용하는 라이브러리.  
넘파이에서 파생되어 만들어졌기 때문에 넘파이 배열 구조를 기반으로 함.

## 1. 라이브러리 import

In [14]:
import pandas as pd

**Series** : index, value로 구성된 1차원 배열 구조 (dictionary와 유사)  
**DataFrame** : 테이블 형식의 데이터를 저장/처리하는 데 사용하는 2차원 배열구조

## 2. DataFrame 생성

### 2-1. 생성 with Dictionary

데이터는 일반적으로 딕셔너리를 사용  
Key : Column
Value : 각 Column의 데이터

In [ ]:
df = pd.DataFrame({"name" : ["Jessica", "Liam", "Sophia", "Alex"],
				   "age": [10,30,29,14],
				   "assign": [100,70,80,95]})

# DataFrame를 출력하는 함수
display(df)

      name  age  Assign
0  Jessica   10     100
1     Liam   30      70
2   Sophia   29      80
3     Alex   14      95

### 2-2. 생성 with iterable

2차원 List를 사용하여 생성할 수도 있음.  
이때 Column은 따로 지정

In [16]:
df = pd.DataFrame([["Jessica",10,100,40],["Liam",30,70,30],["Sophia",29,80,20],["Alex",14,95,10]],
				  columns=["name", "age", "test","assign1"])

display(df)

      name  age  test  assign1
0  Jessica   10   100       40
1     Liam   30    70       30
2   Sophia   29    80       20
3     Alex   14    95       10

### 2-3. 데이터 추가

Dictionary 형식으로 데이터를 추가

In [17]:
df["assign2"] = [10,20,30,40]

display(df)

      name  age  test  assign1  assign2
0  Jessica   10   100       40       10
1     Liam   30    70       30       20
2   Sophia   29    80       20       30
3     Alex   14    95       10       40

## 3. 추출

### 3-1. 열 추출

In [18]:
# Dictionary 형태로 호출
display(df["name"])

0    Jessica
1       Liam
2     Sophia
3       Alex
Name: name, dtype: object

### 3-2. 여러 열 추출

In [19]:
# Dictionary 형태 호출에 List형태로 전달
display(df[["name","age"]])

      name  age
0  Jessica   10
1     Liam   30
2   Sophia   29
3     Alex   14

### 3-3. pop()

Column을 추출한 뒤 원본에서 제거함.  
Series로 반환

In [20]:
# 원본에서 제거됨.
df_assign = df.pop("assign2")
display(df)
display(df_assign)

      name  age  test  assign1
0  Jessica   10   100       40
1     Liam   30    70       30
2   Sophia   29    80       20
3     Alex   14    95       10

0    10
1    20
2    30
3    40
Name: assign2, dtype: int64

## 4. 순회

### 4-1. iterrows()

idx : 각 행의 인덱스  
row : 각 행을 나타내는 Series 객체 (Dictionary처럼 접근 가능)
각 Series에서 인덱스는 원본 df의 Column

In [ ]:
for idx, row in df.iterrows():
	print("idx :", idx)
	print("===row===")
	print(row)
	print()

idx : 0
===row===
name       Jessica
age             10
test           100
assign1         40
sum1           140
sum2            50
sum3            41
Name: 0, dtype: object
idx : 1
===row===
name       Liam
age          30
test         70
assign1      30
sum1        100
sum2         50
sum3         32
Name: 1, dtype: object
idx : 2
===row===
name       Sophia
age            29
test           80
assign1        20
sum1          100
sum2           50
sum3           23
Name: 2, dtype: object
idx : 3
===row===
name       Alex
age          14
test         95
assign1      10
sum1        105
sum2         50
sum3         14
Name: 3, dtype: object

## 5. 연산

### 5-1. 연산

In [22]:
df["sum1"] = df["test"] + df["assign1"]	# Column + Column
df["sum2"] = df["assign1"] + df_assign	# Column + Series
df["sum3"] = df["assign1"] + [1,2,3,4] 	# Column + iterable
display(df)

      name  age  test  assign1  sum1  sum2  sum3
0  Jessica   10   100       40   140    50    41
1     Liam   30    70       30   100    50    32
2   Sophia   29    80       20   100    50    23
3     Alex   14    95       10   105    50    14

### 5-2. sum(), axis

In [ ]:
scores = pd.DataFrame({
    "math": [90, 80, 70],
    "english": [85, 95, 75],
    "science": [88, 92, 78]
}, index=["Alice", "Bob", "Charlie"])

display(scores)
# axis=0 : 열을 기준으로 계산 (기본값)
# axis=1 : 행을 기준으로 계산
display(scores.sum())
display(scores.sum(axis=1))

         math  english  science
Alice      90       85       88
Bob        80       95       92
Charlie    70       75       78

math       240
english    255
science    258
dtype: int64

Alice      263
Bob        267
Charlie    223
dtype: int64

## 6. 조건부 접근

### 6-1. 조건부 접근

In [24]:
display(df["age"] >= 20)	# 각 행이 조건에 부합하는지 True/False Series를 반환
display(df[df["age"]>=20]) 	# 반환된 Series에서 True인 행만 반환

0    False
1     True
2     True
3    False
Name: age, dtype: bool

     name  age  test  assign1  sum1  sum2  sum3
1    Liam   30    70       30   100    50    32
2  Sophia   29    80       20   100    50    23

### 6-2. 여러행 조건부 접근

In [25]:
# df[df["age"]>=20] : True/False Series 반환 후 해당 index가 True인 행만 남음
# [["name","age"]] : True인 행만 남은 상태에서 원하는 Column을 추출
display(df[df["age"]>=20][["name","age"]])

     name  age
1    Liam   30
2  Sophia   29